## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_monitor_alert_prometheus_rule_group.recording-rules-k8s["blue"] will be updated in-place
  ~ resource "azurerm_monitor_alert_prometheus_rule_group" "recording-rules-k8s" {
        id                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.AlertsManagement/prometheusRuleGroups/recording-rules-k8s"
        name                = "recording-rules-k8s"
      ~ tags                = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (7 unchanged attributes hidden)

        # (19 unchanged blocks hidden)
    }

  # azurerm_monitor_alert_prometheus_rule_group.recording-rules-nodes["blue"] will be updated in-place
  ~ resource "azurerm_monitor_alert_prometheus_rule_group" "recording-rules-nodes" {
        id                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.AlertsManagement/prometheusRuleGroups/recording-rules-nodes"
        name                = "recording-rules-nodes"
      ~ tags                = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (7 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # module.aks["blue"].azurerm_kubernetes_cluster.akscluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "akscluster" {
        id                                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerService/managedClusters/prvaks-blue"
        name                                = "prvaks-blue"
        tags                                = {
            "Environment" = "Dev"
            "Owner"       = "kmiszel"
            "Source"      = "Terraform"
        }
        # (37 unchanged attributes hidden)

      ~ default_node_pool {
          ~ auto_scaling_enabled          = false -> true
          ~ max_count                     = 0 -> 3
          ~ min_count                     = 0 -> 2
            name                          = "defaultpool"
            tags                          = {}
          + temporary_name_for_rotation   = "temppool"
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (12 unchanged blocks hidden)
    }

  # module.aks-monitoring.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.aks-monitoring.azurerm_role_assignment.role_monitoring_reader will be created
  + resource "azurerm_role_assignment" "role_monitoring_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0df1cea8-515d-4bcd-b53c-0c45721f2362"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>